app/controllers/books_controller.rb

SELECT * FROM "books" WHERE (title LIKE '%#{params[:search]}%')
---
  def index
    if params[:search]
      @books = Book.find(:all, :conditions => ['title LIKE ?',"%#{params[:search]}%"])

SELECT * FROM "books" WHERE ("books"."id" = 1)
---
  def show
    @book = Book.find(params[:id])

SELECT * FROM "books" WHERE ("books"."id" = 1)
---
  def edit
    @book = Book.find(params[:id])

INSERT INTO "books" ("created_at", "title", "image_url", "quantity", "updated_at", "description") VALUES('2010-09-19 03:40:19', 'Rails', '/images/rails.png', 10, '2010-09-19 03:40:19', 'Rails desc')
---
  def create
    @book = Book.new(params[:book])

    respond_to do |format|
      if @book.save

SELECT * FROM "books" WHERE ("books"."id" = 1)
UPDATE "books" SET "updated_at" = '2010-09-19 04:59:35', "quantity" = 10 WHERE "id" = 1
---
  def update
    @book = Book.find(params[:id])

    respond_to do |format|
      if @book.update_attributes(params[:book])

SELECT * FROM "books" WHERE ("books"."id" = 1)
DELETE FROM "books" WHERE "id" = 1
---
  def destroy
    @book = Book.find(params[:id])
    @book.destroy

SELECT * FROM "books" WHERE ("books"."id" = 1)
---
  def return_book
    Book.find(params[:id]).quantity +=1

SELECT * FROM "borrowed_books" WHERE ("borrowed_books"."user_id" = 3)
---
  def num_books_borrowed
    book_count = (BorrowedBook.find_all_by_user_id(session[:user_id]).count).to_s