app/controllers/borrowed_books_controller.rb

  def index

    user = User.find_by_id(session[:user_id])
    @user_type = user.user_type
    if user.user_type == 'a'
      @borrowed_books = BorrowedBook.find(:all)
    else
      if user.user_type == 'e'
        @borrowed_books = BorrowedBook.find_all_by_user_id(session[:user_id])
---
SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
SELECT * FROM "books" WHERE ("books"."id" = 2)
SELECT * FROM "borrowed_books" WHERE ("borrowed_books"."user_id" = 3)

  def show
    @borrowed_book = BorrowedBook.find(params[:id])
---
SELECT * FROM "borrowed_books" WHERE ("borrowed_books"."id" = 1)

  def create
    @borrowed_book = BorrowedBook.new(params[:borrowed_book])

    respond_to do |format|
      if @borrowed_book.save
---
INSERT INTO "borrowed_books" ("created_at", "updated_at", "borrowed_date", "user_id", "book_id") VALUES('2010-09-19 04:58:14', '2010-09-19 04:58:14', '2010-09-19 04:57:00', 3, 1)

  def return_book
    @borrowed_book = BorrowedBook.find(params[:id])
    #    @borrowed_book.quantity += 1
    #    @borrowed_book.update_attributes(params[:@borrowed_book])
    @borrowed_book.destroy
---
SELECT * FROM "books" WHERE ("books"."id" = 6) LIMIT 1
SELECT * FROM "borrowed_books" WHERE ("borrowed_books"."id" = 1)
DELETE FROM "borrowed_books" WHERE "id" = 1

  def borrow
    book_to_borrow = Book.find(params[:id])
    if book_to_borrow.quantity >1
      book_to_borrow.quantity -= 1
      book_to_borrow.update_attributes(params[:book_to_borrow])
    end
    BorrowedBook.new(:user_id => session[:user_id],:book_id => book_to_borrow.id).save
---
SELECT * FROM "books" WHERE ("books"."id" = 2)
UPDATE "books" SET "updated_at" = '2010-09-19 15:52:35', "quantity" = 99 WHERE "id" = 2
INSERT INTO "borrowed_books" ("borrowed_date", "user_id", "book_id") VALUES('2010-09-19 16:05:40', 3, 1)

  def destroy
    @borrowed_book = BorrowedBook.find(params[:id])
    @borrowed_book.destroy
---
SELECT * FROM "books" WHERE ("books"."id" = 1)
SELECT * FROM "borrowed_books" WHERE ("borrowed_books"."id" = 3)
DELETE FROM "borrowed_books" WHERE "id" = 3

  def num_books_borrowed
    book_count = (BorrowedBook.find_all_by_user_id(session[:user_id]).count).to_s
---
SELECT * FROM "borrowed_books" WHERE ("borrowed_books"."user_id" = 3)