app/controllers/users_controller.rb

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def index
    @users = User.find(:all, :order => :email)

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def show
    @user = User.find(params[:id])

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
---
  def edit
    @user = User.find(params[:id])

INSERT INTO "users" ("name", "address", "salt", "created_at", "updated_at", "hashed_password", "user_type", "phone_number", "email") VALUES('admin', 'Admin Address', '-6168757380.141781701566634', '2010-09-19 00:01:15', '2010-09-19 00:01:15', '4a02d47b20e64bc641008f96379182f91a2f5d78', 'e', 1000000000, 'vlib.kodexter@gmail.com')
---
  def create
    @user = User.new(params[:user])

    respond_to do |format|
      if @user.save

SELECT * FROM "users" WHERE ("users"."id" IS NULL) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-09-19 00:17:58', "salt" = '-6161966980.454315011687763', "user_type" = 'a', "hashed_password" = '184079f39adec37297427bdd3f2d5a5676c7c436' WHERE "id" = 2
---
  def update
    @user = User.find(params[:id])

    respond_to do |format|
      if @user.update_attributes(params[:user])

SELECT * FROM "users" WHERE ("users"."id" = 2) LIMIT 1
UPDATE "users" SET "updated_at" = '2010-09-19 01:02:17', "user_type" = 'd' WHERE "id" = 4
---
  def enable_or_disable
    @user = User.find(params[:id])
    begin
      if(@user.user_type == 'e')
        @user.user_type = 'd'
        if(@user.update_attributes(params[:user]))

SELECT * FROM "users" WHERE ("users"."user_type" = 'e')
---
  def user_statistics
    enabled_user_count = (User.find_all_by_user_type('e').count).to_s